[{"title":"Inferiority complex and superiority complex","body":"Inferiority complex ဆိုတာ သိမ်ငယ်တဲ့စိတ် အငုံ.စိတ်လို.ဆိုတာ။ Superiority complex ဆိုတာကတော့ ဘဝမြင့်စိတ်ကိုရည်ညွှန်းတာ။\nအဲ့၂ခုက ဆက်စပ်နေတယ် နောက်ပြီး အငုံ.စိတ်နဲ.နေလာခဲ့ရတဲ့သူတွေကို ကြုံဖူးတာပိုများတယ်။\nအငုံ.စိတ်ဆိုတာ ကိုယ့်ကိုကိုယ် နိမ့်ကျနေတယ်၊ တခုခုမှာ မတော်ဘူး မကောင်းဘူး သူူများလောက်အဖြစ်မရှိဘူး အဲ့လိုခံစားနေရတာကိုပြောတာ။ ဘာလို.အငုံ.စိတ်ဖြစ်လာလဲဆိုရင် အကြောင်းတခုခုမှာ သူက သူများထက်ပိုပြီးနောက်ကိုရောက်နေမယ် သူများတွေ သူနဲ.တန်းတူ အသက်တူရွယ်တူတွေလုပ်နိုင်တာ အောင်မြင်နိုင်တာကို သူက ခနခန အဆင်မပြေဖြစ်မယ် ကျရှုံးမယ်ဆိုရင် ဒါက အငုံ.စိတ်ဖြစ်လာမယ်။\nလူတွေမှာ သူတို.လိုအင်ဆန္ဒတွေ ရယူချင်တာတွေ အိမ်မက်တွေရှိကြတယ်။ အဲ့ဒါတွေကို ရဖို.ကြိုးစားရင်း ခနခနခ ကျရှုံးလာတဲ့အခါမှာ hopless ဖြစ်လာမယ် သူတို.ကိုယ်သူတို.သံသယဝင်လာမယ် အဲ့လိုနည်းနဲ. အငုံ.စိတ်ဖြစ်လာတယ်။\nလူတိုင်း တချိန်မဟုတ်တချိန် အငုံ.စိတ်ဖြစ်ကြတယ်။ ဒါပေမဲ့ အဲ့ဒါကိုကျော်လွှားနိုင်တဲ့သူတွေလဲရှိမယ်။ ကျော်လွှားနိုင်ပေမဲ့ တချိန်ချိန် အဲ့ဒီအငုံ.စိတ် ပြန်ပေါ်လာတတ်တာမျိုးလဲရှိတယ်။\nအဲ့ဒီ အငုံ.စိတ်က ကောင်းကျိုးလဲ ပေးသလိုဆိုးကျိုးလဲပေးတယ်။ ဘယ်လိုနေရာမှာကောင်းကျိုးပေးသလဲဆိုရင် အငုံ.စိတ်ကြောင့် ပိုကြိုးစားဖြစ်မယ်။ ကိုယ့်ကို ပိုကောင်းအောင်တွန်းအားဖြစ်စေမယ်။ Inferiority complex ကိုကျော်လွှားရင်းနဲ. ကြိုးစားရင်းနဲ. superiority complex(ဘဝင်မြင့်စိတ်) ဖြစ်လာနိုင်တယ်။\nအဲ့လိုကြုံဖူးတာ သုံးလေး ယောက်လောက်တွေ.ဖူးတယ်။ ဆယ်တန်းကျောင်းသားဘဝက ရွယ်တူ သူငယ်ချင်းတယောက်က ဆယ်တန်းကို တနှစ်ကျတယ်။ နောက် အောင်သွားတော့ တရားရုံးချုပ်ရှေ.နေ.တွေဘာတွေဖြစ်လာတယ်။ သူ.မှာ inferoirity complex ရှိနေတုံး ဘာလို.အဲ့လိုသိလဲဆိုရင် တခုခုဆိုရင် သူ.မှာ power ပြချင်စိတ် အာဏာသုံးချင်စိတ် ဆိုတာဖြစ်နေတယ် ဘာလို.လဲဆိုတော့ ငယ်ငယ်က အငုံ.စိတ်ရှိတဲ့သူတွေက အဲ့လိုကာကွယ်ရင်းနဲ. သူများကို bully ဖြစ်သွားတာ။ သူ Bully လုပ်တာသည် သူ.ရဲ. အငုံ.စိတ်ကို ကာကွယ်ဖို. (ငါက ဟိုတုန်းကလိုမဟုတ်တော့ဘူးကွ ခုက ဘာကောင်ဆိုတဲ့သဘောပေါ့)။\nတက္ကသိုလ်ကျောင်းသားဘဝမှာ ဆရာမတယောက်က Thesis လုပ်သမျှ ကျောင်းသား တော်တော်များများကို bully လုပ်တယ် (ဆိုချင်တာက ကျောင်းသား မဖြေနိုင်ပြီးရော အခက်တွေ.တဲ့မေးခွန်း မေးလိုက်မိတာကိုပဲ သဘောကျနေတာ (တကယ်က ပညာရပ်ဆိုင်ရာ သဘောတရား ဘာမှမပါဘူး)) သူက အဲ့လို ကျောင်းသားတွေကို ငါသည် powerful ဖြစ်ကြောင်းပြနေရင်းနဲ. စိတ်ကျေနပ်မှူ.ကို တနည်းနည်းနဲ.ရယူနေတာ။ သူ.နောက်ကြောင်းကိုစစ်လိုက်တော့ သူဒေါက်တာဘွဲ.ယူစဉ်က သူများထက်ပိုဆိုးဆိုးရွားရွား အဆင်မပြေလို. ကြိုးစားခဲ့ရတယ်ဆိုတာကို သွားတွေ.တယ်။ အဲ့တော့မှ အော်သူက သူ.ကိုယ်သူ စိတ်ကျေနပ်အောင်သူများ bully လုပ်နေတာပါလားလို. တွေးမိတယ်။\nနောက် ခုနက အငုံ.စိတ်ရှိတဲ့သူများဟာ ဘဝမှာ အရှုံးဆိုတာမျိုး အဆင်မပြေတာ များများကြံုတွေလာရတော့ တခါတလေမှာ သူတို.နိုင်ကွက်ရပြီဆိုရင်ကို ဖိထောင်းချင်တဲ့သဘာဝ ရှိတယ်။ ဥပမာ သူများ မသိတဲ့ မေးခွန်းရဲ. အဖြေလောက်ကို သူတို.တခါလောက်မသိနဲ. အဲ့လူ အလှောင်ခံရပြီသာမှတ်။ အဲ့လို ကြံုဖူးတယ်။ နောက် သူတို.ငယ်စဉ်က ခေါ်တဲ့ ငယ်ကျိုးငယ်နာမည်တွေ ခေါ်တာ လုံးဝ သဘောမကျဘူး။ အမှန်က ငယ်နာမည် ငပြောင်နာမည် သဘောမကျတာမဟုတ်ဘူး အဲ့လိုသူများက သူတို.ခေါ်နေတာသည် သူတို.ရဲ. အငုံ.စိတ်ကိုပြန် သတိရစေလို. အဲ့ဒါကို သည်းမခံနိုင်တာ။\nအငုံ.စိတ်က နေလွတ်အောင်ကြိုးစားရင်း တချိန်ချိန်မှာ အဆင်ပြေလာတဲ့အတိုင်းအတာတခုရောက်လာတော့ ခုနက အငုံ.စိတ်ရှိတဲ့သူတွေဟာ superiority complex ပေါ်လာနိုင်တယ် ခုနက အပေါ်ကလူတွေလိုပေါ့ ငါဘယ်လောက်လုပ်နိုင်ကြောင်း ဘယ်လောက်စွမ်းကြောင်း သူများ power ပြနေတာမျိုူး။ အမှန်က သူများ bully လုပ်တယ်လို.မမြင်ပဲ သူတို.သည် feel powerful ဆိုတဲ့စိတ်မျိုးကို မခံစားဖူးတဲ့အတွက် အဲ့လိုလုပ်နေရတာကို သဘောကျနေကြတာ။ သူတို.က အရှုံးနဲ.ပဲရင်ဆိုင်ခဲ့ရတော့ ခုလို သူများအပေါ် အဲ့လိုလုပ်ရတာသည်သူတို. power ရှိတယ်ဆိုတဲ့အတွေး ခံစားမှု.ကြောင့်လုပ်တာ။\nအငုံ.စိတ်ရှိတဲ့သူများက တိုင်ပင်လို.မကောင်းဘူး ဘာလို.လဲဆိုတော့သူတို.က failure ကိုပဲမြင်တယ်။ သူတို.မအောင်မြင်တာတွေ မလုပ်နိုင်တာတွေကိုသူများတွေလဲဒီလိုပဲဖြစ်မယ်လို.မြင်တယ်။ သူတို.ကိုယ်တိုင်နဲ. တိုင်းတာပြီး စဉ်းစားရတာကိုး။\nအငုံ.စိတ် မဖြစ်အောင် ဘယ်လိုထားရမလဲဆိုရင် လူတိုင်းဟာ ဘက်စုံမတော်နိုင်ဘူး ။ကိုက တနေရာမှာ မတော်နိုင်ပေမဲ့ တခြားတနေရာမှာ တော်နိုင်တယ်။ ငါဟာအညံ့ကြီးမဟုတ်ပါလား ။ ငါကဒီနေရာမဟုတ်ပေမဲ့ တခြားနေရာလေးတော့မဆိုးဘူးဆိုတာလေး တွေးတတ်ရင်အဆင်ပြေတယ်။ တချို.လူတွေမှာ gift ပါလာတယ်။ သဘာဝကိုက သူက တခုခုမှာ ဘယ်လောက်မှ မသင်ပဲတတ်နေနိုင်တာမျိုး ဒါကိုလဲနားလည်ထားရမယ်။ မဟုတ်ရင် အဲ့လိုလူတွေနဲ. နှိုင်းယှဉ်နေရင်း အလိုမကျမှု.များလာရင် အငုံ.စိတ်ပိုများလာမယ်။"},{"title":"How to search in Google","body":"Computer သမားတော်တော် များများကတော့ Google သုံးတတ်ပေမဲ့ ကျန်တဲ့သူတွေ အသုံးဝင်အောင် ပေါ့။ တခါတလေလဲ တရာဖိုး သုံးပုဒ်လေးပုဒ်ပေါ့။သူများတွေရေးဖူးတာလဲ တွေ.ဖူးတယ် ရှာမရတော့လို.။\nFile အမျိုးအစားလိုက် ရှာချင်ရင်\nဥပမာ PDF  file တွေကိုပဲလိုချင်ရင် filetype:pdf  ဆိုပြီးရိုက်လိုက်ပါ။ ဥပမာ     java နဲ.ပတ်သတ်တဲ့ pdf file တွေပဲလိုချင်ရင် google မှာ java filetype:pdf  ဆိုပြီးရှာလိုက်ရင် java ပါတဲ့  pdf document  တွေပြပါလိမ့်မယ်။ \nSite တခုခုထဲကပဲရှာချင်ရင်\nဥပမာ oracle site တခုထဲကိုပဲရှာမယ်  Java ဆိုတာကိုပဲရှာမယ်။ဒါဆိုရင်  java site:oracle.com ဆိုရင်ရပါပြီ။ site: နောက်မှာကိုရှာချင်တဲ့ website ကိုထဲ့ပေးလိုက်ရုံပါပဲ။ domain extension တွေလဲ site နဲ.ရှာလို.ရပါတယ် ဥပမာ government  site တွေချည်းပဲရှာချင်ရင် site:gov ဆိုပြီးရှာရင်ရပါတယ်။\nစကားလုံးအတိအကျ  pahrase အလိုက်ရှာချင်ရင် ဥပမာ Java"}]